<h1>Missing data treatment</h1>

<p>Continuation of the study about DataFrames</p>

<p>Continuação do estudo sobre DataFrames</p>

In [2]:
import numpy as np
import pandas as pd

In [5]:
# The np.nan method creates missing fields

df = pd.DataFrame({ 'A': [1,2,np.nan],
                    'B': [5, np.nan, np.nan],
                    'C': [1, 2, 3]})

df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
#This method removes rows and columns that contain missing values
#In this case, the method removes the rows
#If I need to permanently modify the DataFrame, I need to use 'inplace=True'

df.dropna()

     A    B  C
0  1.0  5.0  1

In [9]:
#To remove columns with missing values using the dropna() method, I need to specify the axis.
#Axis 0 = Rows, Axis 1 = Columns

df.dropna(axis=1)

   C
0  1
1  2
2  3

In [11]:
#I can specify the limit of missing data to remove a row or column using the parameter thresh

df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [13]:
#The fillna() method is used to fill missing data fields with something
#If I need to permanently modify the DataFrame, I need to use 'inplace=True'

df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [14]:
df.fillna('something')

           A          B  C
0        1.0        5.0  1
1        2.0  something  2
2  something  something  3

In [17]:
#Filling missing values in column 'A' with the mean of the data from the same column

df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [19]:
#filling with the last observed data
#There is a method that does the opposite, bfill(), but in our example it won't work very well

df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3